In [4]:

import pandas as pd

import seaborn as sns

In [7]:

df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
dnaDf = df.dropna()
dnaDf

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [5]:
#각 컬럼별 NaN의 갯수
df.age.isnull().sum()

177

In [6]:
len(df.index)

891

In [7]:
#NaN이 2개 이상인것은 무조건 삭제
colLen=len(df.columns) # 컬럼의 갯수
dropRow=df.dropna(thresh=colLen-2)
len(dropRow.index)

891

In [8]:
#fare의 경우 평균값으로 채우기
df["fare"].fillna(df["fare"].mean(), inplace=True)

In [9]:
#age는 중앙값으로 채우기
df["age"].fillna(df["age"].median(), inplace=True)

In [10]:
#그 외는 최빈값으로 채우기
colList=list(df.columns)
f=lambda x: df[x].mode()[0]
modeList=list(map(f,list(df.columns)))
modeList

[0,
 3,
 'male',
 28.0,
 0,
 0,
 8.05,
 'S',
 'Third',
 'man',
 True,
 'C',
 'Southampton',
 'no',
 True]

In [11]:
i=0

for modeVal in modeList:
    colName =colList[i]
    df[colName].fillna(modeVal, inplace=True)
    i+=1
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,C,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,C,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,C,Queenstown,no,True

In [12]:
#승선자의 평균 나이를 구하세요 
df["age"].mean()

29.36158249158249

In [13]:
#클래스별  승선인원
df["class"].unique() #[Third, First, Second]

df["cls_f"]=df["class"]=="First"
df.cls_f.replace({False:0,True:1}, inplace=True)
df[["class","cls_f"]]

df.cls_f.sum()
#type(df[df["class"]=="First"].sum())
#df[df["class"]=="First"].sum()

216

In [14]:
temp=[]
clsNumList=[]#[Third, First, Second]
ca=df["class"].unique()
#ca[0]
for cls in ca:
    print(cls)
    df.cls_n=df["class"]==cls
    df.cls_n.replace({False:0,True:1}, inplace=True)
    temp.append(df.cls_n.sum())
    
# clsNumList.sort(reverse=True)
# print("first, second, Third  순서")
clsNumList.append(temp[1])
clsNumList.append(temp[2])
clsNumList.append(temp[0])
clsNumList# 총 승선한 클래스 인원 리스트 (first, second, third)

Third
First
Second

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  import sys

[216, 184, 491]

In [15]:
#클래스별 생존자의 수를 구하세요(5점) 
df.groupby("class")["age"].count()

class
First     216
Second    184
Third     491
Name: age, dtype: int64

In [16]:
cls_gr=df.groupby("class")["age"].count()
cls_gr.index

CategoricalIndex(['First', 'Second', 'Third'], categories=['First', 'Second', 'Third'], ordered=False, name='class', dtype='category')

In [17]:
cls_gr.index[0]

'First'

In [28]:
#클래스별 승선인원을 구하세요 
for i in range(len(cls_gr.index)):
    print(i)
    print(cls_gr.index[i],cls_gr[i])

0
First 216
1
Second 184
2
Third 491

In [29]:
df.groupby("class")["survived"]

In [30]:
surClsNumList=df.groupby("class")["survived"].sum()
surClsNumList

class
First     136
Second     87
Third     119
Name: survived, dtype: int64

In [31]:
len(surClsNumList.index)

3

In [33]:
#클래스별 생존율을 구하세요
perList=[]
for i in range(len(surClsNumList.index)):
    
    perList.append(round(surClsNumList[i]/clsNumList[i],2))
perList

    
# 총 승선한 클래스 인원 리스트 (first, second, third)

[0.63, 0.47, 0.24]

In [71]:
#생존자중 남성과 여성의 비율을 구하세요 (10점)
surList=[]
surSeries = df.groupby("sex")["survived"].count()

#total = surSeries [0]+surSeries[1]#0 female, 1 male
total = surSeries.sum()
femaleNum=surSeries [0]
maleNum=surSeries [1]

for cn in surSeries:
    surList.append(round(cn/total,2))

surList

[0.35, 0.65]

In [73]:
#생존자의 비율중 남자, 여자, 아이의 비율을 구하세요 (20점)
whoList = []
whoSeries = df.groupby("who")["survived"].count()

whoTotal =whoSeries.sum()

childNum=whoSeries [0]
manNum=whoSeries [1]
woman=whoSeries [2]

for cn in whoSeries:
    whoList.append(round(cn/whoTotal,2))
print("child","man","woman")
whoList

child man woman

[0.09, 0.6, 0.3]

In [80]:
#생존자의 평균 나이를 구하세요 (5점)
surAgeSum=df.groupby("survived")["age"].sum()
# print(surAgeSum)
surAgeCount=df.groupby("survived")["age"].count()

# print(surAgeCount)

surAvgAge=round(surAgeSum[1]/surAgeCount[1],2)
print(surAvgAge)

survived
0    16485.50
1     9675.67
Name: age, dtype: float64
survived
0    549
1    342
Name: age, dtype: int64
28.29